app/controllers/cases_controller.rb

  def index
    @empty_search = false
    @clinician_id = params[:clinician_id].to_i
    @allowed = @clinician_id == current_clinician.id
    @cases = Clinician.find(@clinician_id).cases
    if params[:search].present?
      if params[:search].empty?
        @cases = []
      else
        @cases = Case.search(params[:search])
---
SELECT "cases".* FROM "cases"

  def edit
    @clinician_id = params[:clinician_id].to_i
    @case_id = params[:id].to_i
    if @clinician_id != current_clinician.id
      flash[:warning] = "You cannot edit cases you are not a part of"
      redirect_to clinician_cases_path(@clinician_id)
    else
      @clinician = Clinician.find(@clinician_id)
      @case = @clinician.cases.find(@case_id)
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @clinician_id = params[:clinician_id].to_i
    @clinician = Clinician.find(@clinician_id)
    @case = @clinician.cases.new(case_params)
    if @case.save
---
INSERT INTO "cases" ("name", "diagnosis", "age", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "A"], ["diagnosis", "A"], ["age", 0], ["gender", "Male"], ["created_at", "2016-03-29 02:51:45.939817"], ["updated_at", "2016-03-29 02:51:45.939817"]]

  def update
    @clinician_id = params[:clinician_id].to_i
    @case_id = params[:id].to_i
    @clinician = Clinician.find(current_clinician.id)
    @case = @clinician.cases.find(@case_id)
    if @case.update(case_params)
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cases" SET "name" = ?, "diagnosis" = ?, "age" = ?, "gender" = ?, "updated_at" = ? WHERE "cases"."id" = ?  [["name", "Aadfa"], ["diagnosis", "Aadsf"], ["age", 0], ["gender", "Female"], ["updated_at", "2016-03-29 03:39:39.998679"], ["id", 1]]

  def show
    @clinician_id = params[:clinician_id].to_i
    @clinician = Clinician.find(@clinician_id)
    @case_id = params[:id].to_i
    @allowed = @clinician_id == current_clinician.id
    @case = @clinician.cases.find(@case_id)
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @clinician_id = params[:clinician_id].to_i
    @clinician = Clinician.find(@clinician_id)
    @case_id = params[:id].to_i
    if @clinician_id != current_clinician.id
      flash[:warning] = "You cannot delete cases you are not a part of"
      redirect_to clinician_cases_path(@clinician_id)
    else
      @case = @clinician.cases.find(@case_id)
      @case.destroy
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "cases" WHERE "cases"."id" = ?  [["id", 1]]