app/controllers/clinicians_controller.rb

INSERT INTO "clinicians" ("name", "email", "specialty") VALUES (?, ?, ?)  [["name", "asdad"], ["email", "asdas "], ["specialty", "asd"]]
---
  def create
    @clinician = Clinician.new(clinician_params)
    if @clinician.save

SELECT  "clinicians".* FROM "clinicians" WHERE "clinicians"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @clinician = Clinician.find(params[:id])